---
kind: property
id: P:Autodesk.Revit.DB.Sweep.ProfileSketch
source: html/84a0db17-c3d3-bf8b-e80b-e8d5b419ce1c.htm
---
# Autodesk.Revit.DB.Sweep.ProfileSketch Property

The profile sketch of the sweep.

## Syntax (C#)
```csharp
public Sketch ProfileSketch { get; }
```

## Remarks
If the profile is not based on sketched curves, this property is Nothing nullptr a null reference ( Nothing in Visual Basic) .